[Killed] BlockStatement
lib/ccvs/drift-detector.ts:19:42
   invalidated_attestations: string[];
 }
 
-function sha256Hex(data: string): string {
-  return crypto.createHash('sha256').update(data, 'utf8').digest('hex');
-}
+function sha256Hex(data: string): string {}
 
 export function buildDriftSnapshot(overrides: Partial<DriftSnapshot> = {}): DriftSnapshot {
killedBy: buildDriftSnapshot deployment_config_hash changes when GITHUB_SHA changes
statusReason: expected 'sha256:undefined' not to be 'sha256:undefined' // Object.is equality

[Killed] BlockStatement
lib/ccvs/drift-detector.ts:23:91
   return crypto.createHash('sha256').update(data, 'utf8').digest('hex');
 }
 
-export function buildDriftSnapshot(overrides: Partial<DriftSnapshot> = {}): DriftSnapshot {
-  const deploymentConfigFields = {
-    NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? '',
-    DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? '',
-    VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? '',
-    GITHUB_SHA: process.env.GITHUB_SHA ?? '',
-  };
-
-  return {
-    policy_version: overrides.policy_version ?? process.env.DSG_POLICY_VERSION ?? 'v1',
-    hash_algorithm: 'sha256',
-    deployment_config_hash:
-      overrides.deployment_config_hash ?? 'sha256:' + sha256Hex(JSON.stringify(deploymentConfigFields)),
-    schema_version: overrides.schema_version ?? '1.0.0',
-    captured_at: overrides.captured_at ?? new Date().toISOString(),
-  };
-}
+export function buildDriftSnapshot(overrides: Partial<DriftSnapshot> = {}): DriftSnapshot {}
 
 export function detectDrift(previous: DriftSnapshot | null, current: DriftSnapshot): DriftReport {
killedBy: buildDriftSnapshot includes policy_version from env
statusReason: Cannot read properties of undefined (reading 'policy_version')

[Killed] LogicalOperator
lib/ccvs/drift-detector.ts:25:31
 
 export function buildDriftSnapshot(overrides: Partial<DriftSnapshot> = {}): DriftSnapshot {
   const deploymentConfigFields = {
-    NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? '',
+    NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL && '',
     DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? '',
     VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? '',
killedBy: buildDriftSnapshot deployment_config_hash is same whether NEXT_PUBLIC_SUPABASE_URL is unset or empty string
statusReason: expected 'sha256:8e0186705b6c5b760921eaad277904…' to be 'sha256:e97038d08d1dd93e2ed9ce32040f09…' // Object.is equality

[Killed] StringLiteral
lib/ccvs/drift-detector.ts:25:71
 
 export function buildDriftSnapshot(overrides: Partial<DriftSnapshot> = {}): DriftSnapshot {
   const deploymentConfigFields = {
-    NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? '',
+    NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? "Stryker was here!",
     DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? '',
     VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? '',
killedBy: buildDriftSnapshot deployment_config_hash is same whether NEXT_PUBLIC_SUPABASE_URL is unset or empty string
statusReason: expected 'sha256:bbcf939988f6cfb6c0aaddb5170eed…' to be 'sha256:e97038d08d1dd93e2ed9ce32040f09…' // Object.is equality

[Killed] LogicalOperator
lib/ccvs/drift-detector.ts:26:33
 export function buildDriftSnapshot(overrides: Partial<DriftSnapshot> = {}): DriftSnapshot {
   const deploymentConfigFields = {
     NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? '',
-    DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? '',
+    DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL && '',
     VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? '',
     GITHUB_SHA: process.env.GITHUB_SHA ?? '',
killedBy: buildDriftSnapshot deployment_config_hash is same whether DSG_CONTROL_PLANE_BASE_URL is unset or empty string
statusReason: expected 'sha256:9a698d6b807e52adc0e3f7ce569dc6…' to be 'sha256:e97038d08d1dd93e2ed9ce32040f09…' // Object.is equality

[Killed] StringLiteral
lib/ccvs/drift-detector.ts:26:75
 export function buildDriftSnapshot(overrides: Partial<DriftSnapshot> = {}): DriftSnapshot {
   const deploymentConfigFields = {
     NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? '',
-    DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? '',
+    DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? "Stryker was here!",
     VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? '',
     GITHUB_SHA: process.env.GITHUB_SHA ?? '',
killedBy: buildDriftSnapshot deployment_config_hash is same whether DSG_CONTROL_PLANE_BASE_URL is unset or empty string
statusReason: expected 'sha256:3c5c95978561eb53c5bfb868116cd6…' to be 'sha256:e97038d08d1dd93e2ed9ce32040f09…' // Object.is equality

[Killed] LogicalOperator
lib/ccvs/drift-detector.ts:27:28
   const deploymentConfigFields = {
     NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? '',
     DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? '',
-    VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? '',
+    VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA && '',
     GITHUB_SHA: process.env.GITHUB_SHA ?? '',
   };
killedBy: buildDriftSnapshot deployment_config_hash is same whether VERCEL_GIT_COMMIT_SHA is unset or empty string
statusReason: expected 'sha256:e88ce1283c968c51061aaa32c43c23…' to be 'sha256:e97038d08d1dd93e2ed9ce32040f09…' // Object.is equality

[Killed] StringLiteral
lib/ccvs/drift-detector.ts:27:65
   const deploymentConfigFields = {
     NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? '',
     DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? '',
-    VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? '',
+    VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? "Stryker was here!",
     GITHUB_SHA: process.env.GITHUB_SHA ?? '',
   };
killedBy: buildDriftSnapshot deployment_config_hash is same whether VERCEL_GIT_COMMIT_SHA is unset or empty string
statusReason: expected 'sha256:ab9870f9d8c04e7acc80f7e9380417…' to be 'sha256:e97038d08d1dd93e2ed9ce32040f09…' // Object.is equality

[Killed] LogicalOperator
lib/ccvs/drift-detector.ts:28:17
     NEXT_PUBLIC_SUPABASE_URL: process.env.NEXT_PUBLIC_SUPABASE_URL ?? '',
     DSG_CONTROL_PLANE_BASE_URL: process.env.DSG_CONTROL_PLANE_BASE_URL ?? '',
     VERCEL_GIT_COMMIT_SHA: process.env.VERCEL_GIT_COMMIT_SHA ?? '',
-    GITHUB_SHA: process.env.GITHUB_SHA ?? '',
+    GITHUB_SHA: process.env.GITHUB_SHA && '',
   };
 
killedBy: buildDriftSnapshot deployment_config_hash changes when GITHUB_SHA changes
statusReason: expected 'sha256:67dbd915f41114a2e343743bc52346…' not to be 'sha256:67dbd915f41114a2e343743bc52346…' // Object.is equality

[Killed] LogicalOperator
lib/ccvs/drift-detector.ts:32:21
   };
 
   return {
-    policy_version: overrides.policy_version ?? process.env.DSG_POLICY_VERSION ?? 'v1',
+    policy_version: (overrides.policy_version ?? process.env.DSG_POLICY_VERSION) && 'v1',
     hash_algorithm: 'sha256',
     deployment_config_hash:
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
lib/ccvs/drift-detector.ts:32:21
   };
 
   return {
-    policy_version: overrides.policy_version ?? process.env.DSG_POLICY_VERSION ?? 'v1',
+    policy_version: overrides.policy_version && process.env.DSG_POLICY_VERSION ?? 'v1',
     hash_algorithm: 'sha256',
     deployment_config_hash:
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
lib/ccvs/drift-detector.ts:35:7
     policy_version: overrides.policy_version ?? process.env.DSG_POLICY_VERSION ?? 'v1',
     hash_algorithm: 'sha256',
     deployment_config_hash:
-      overrides.deployment_config_hash ?? 'sha256:' + sha256Hex(JSON.stringify(deploymentConfigFields)),
+      overrides.deployment_config_hash && 'sha256:' + sha256Hex(JSON.stringify(deploymentConfigFields)),
     schema_version: overrides.schema_version ?? '1.0.0',
     captured_at: overrides.captured_at ?? new Date().toISOString(),
killedBy: buildDriftSnapshot deployment_config_hash changes when GITHUB_SHA changes
statusReason: expected undefined not to be undefined // Object.is equality

[Survived] LogicalOperator
lib/ccvs/drift-detector.ts:36:21
     hash_algorithm: 'sha256',
     deployment_config_hash:
       overrides.deployment_config_hash ?? 'sha256:' + sha256Hex(JSON.stringify(deploymentConfigFields)),
-    schema_version: overrides.schema_version ?? '1.0.0',
+    schema_version: overrides.schema_version && '1.0.0',
     captured_at: overrides.captured_at ?? new Date().toISOString(),
   };

[Killed] LogicalOperator
lib/ccvs/drift-detector.ts:37:18
     deployment_config_hash:
       overrides.deployment_config_hash ?? 'sha256:' + sha256Hex(JSON.stringify(deploymentConfigFields)),
     schema_version: overrides.schema_version ?? '1.0.0',
-    captured_at: overrides.captured_at ?? new Date().toISOString(),
+    captured_at: overrides.captured_at && new Date().toISOString(),
   };
 }
killedBy: buildDriftSnapshot captured_at is a valid ISO date
statusReason: Invalid time value

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:44:7
 export function detectDrift(previous: DriftSnapshot | null, current: DriftSnapshot): DriftReport {
   const fieldsChanged: string[] = [];
 
-  if (previous) {
+  if (true) {
     const keys: (keyof DriftSnapshot)[] = [
       'policy_version',
killedBy: detectDrift — no previous changed=false when previous is null
statusReason: Cannot read properties of null (reading 'policy_version')

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:44:7
 export function detectDrift(previous: DriftSnapshot | null, current: DriftSnapshot): DriftReport {
   const fieldsChanged: string[] = [];
 
-  if (previous) {
+  if (false) {
     const keys: (keyof DriftSnapshot)[] = [
       'policy_version',
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
lib/ccvs/drift-detector.ts:47:7
   if (previous) {
     const keys: (keyof DriftSnapshot)[] = [
       'policy_version',
-      'hash_algorithm',
+      "",
       'deployment_config_hash',
       'schema_version',
killedBy: detectDrift — with previous detects hash_algorithm change
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
lib/ccvs/drift-detector.ts:48:7
     const keys: (keyof DriftSnapshot)[] = [
       'policy_version',
       'hash_algorithm',
-      'deployment_config_hash',
+      "",
       'schema_version',
     ];
killedBy: detectDrift — with previous detects deployment_config_hash change
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/ccvs/drift-detector.ts:51:29
       'deployment_config_hash',
       'schema_version',
     ];
-    for (const key of keys) {
-      if (previous[key] !== current[key]) fieldsChanged.push(key);
-    }
+    for (const key of keys) {}
   }
 
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/ccvs/drift-detector.ts:52:11
       'schema_version',
     ];
     for (const key of keys) {
-      if (previous[key] !== current[key]) fieldsChanged.push(key);
+      if (previous[key] === current[key]) fieldsChanged.push(key);
     }
   }
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected [ 'hash_algorithm', …(2) ] to include 'policy_version'

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:52:11
       'schema_version',
     ];
     for (const key of keys) {
-      if (previous[key] !== current[key]) fieldsChanged.push(key);
+      if (false) fieldsChanged.push(key);
     }
   }
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:56:19
     }
   }
 
-  const changed = fieldsChanged.length > 0;
+  const changed = false;
 
   const invalidatedAttestations: string[] = [];
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/ccvs/drift-detector.ts:56:19
     }
   }
 
-  const changed = fieldsChanged.length > 0;
+  const changed = fieldsChanged.length >= 0;
 
   const invalidatedAttestations: string[] = [];
killedBy: detectDrift — no previous changed=false when previous is null
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:59:7
   const changed = fieldsChanged.length > 0;
 
   const invalidatedAttestations: string[] = [];
-  if (fieldsChanged.includes('policy_version')) {
+  if (true) {
     invalidatedAttestations.push('all_compliance_attestations', 'all_evidence_envelopes');
   }
killedBy: detectDrift — no previous changed=false when previous is null
statusReason: expected [ 'all_compliance_attestations', …(1) ] to have a length of +0 but got 2

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:59:7
   const changed = fieldsChanged.length > 0;
 
   const invalidatedAttestations: string[] = [];
-  if (fieldsChanged.includes('policy_version')) {
+  if (false) {
     invalidatedAttestations.push('all_compliance_attestations', 'all_evidence_envelopes');
   }
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected [] to include 'all_compliance_attestations'

[Killed] StringLiteral
lib/ccvs/drift-detector.ts:60:34
 
   const invalidatedAttestations: string[] = [];
   if (fieldsChanged.includes('policy_version')) {
-    invalidatedAttestations.push('all_compliance_attestations', 'all_evidence_envelopes');
+    invalidatedAttestations.push("", 'all_evidence_envelopes');
   }
   if (fieldsChanged.includes('hash_algorithm')) {
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected [ '', 'all_evidence_envelopes' ] to include 'all_compliance_attestations'

[Killed] StringLiteral
lib/ccvs/drift-detector.ts:60:65
 
   const invalidatedAttestations: string[] = [];
   if (fieldsChanged.includes('policy_version')) {
-    invalidatedAttestations.push('all_compliance_attestations', 'all_evidence_envelopes');
+    invalidatedAttestations.push('all_compliance_attestations', "");
   }
   if (fieldsChanged.includes('hash_algorithm')) {
killedBy: detectDrift — with previous detects policy_version change
statusReason: expected [ 'all_compliance_attestations', '' ] to include 'all_evidence_envelopes'

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:62:7
   if (fieldsChanged.includes('policy_version')) {
     invalidatedAttestations.push('all_compliance_attestations', 'all_evidence_envelopes');
   }
-  if (fieldsChanged.includes('hash_algorithm')) {
+  if (false) {
     invalidatedAttestations.push('all_integrity_hashes');
   }
killedBy: detectDrift — with previous detects hash_algorithm change
statusReason: expected [] to include 'all_integrity_hashes'

[Killed] BlockStatement
lib/ccvs/drift-detector.ts:62:49
   if (fieldsChanged.includes('policy_version')) {
     invalidatedAttestations.push('all_compliance_attestations', 'all_evidence_envelopes');
   }
-  if (fieldsChanged.includes('hash_algorithm')) {
-    invalidatedAttestations.push('all_integrity_hashes');
-  }
+  if (fieldsChanged.includes('hash_algorithm')) {}
   if (fieldsChanged.includes('deployment_config_hash')) {
     invalidatedAttestations.push('deployment_provenance', 'sbom_attestation');
killedBy: detectDrift — with previous detects hash_algorithm change
statusReason: expected [] to include 'all_integrity_hashes'

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:65:7
   if (fieldsChanged.includes('hash_algorithm')) {
     invalidatedAttestations.push('all_integrity_hashes');
   }
-  if (fieldsChanged.includes('deployment_config_hash')) {
+  if (true) {
     invalidatedAttestations.push('deployment_provenance', 'sbom_attestation');
   }
killedBy: detectDrift — no previous changed=false when previous is null
statusReason: expected [ 'deployment_provenance', …(1) ] to have a length of +0 but got 2

[Killed] BlockStatement
lib/ccvs/drift-detector.ts:65:57
   if (fieldsChanged.includes('hash_algorithm')) {
     invalidatedAttestations.push('all_integrity_hashes');
   }
-  if (fieldsChanged.includes('deployment_config_hash')) {
-    invalidatedAttestations.push('deployment_provenance', 'sbom_attestation');
-  }
+  if (fieldsChanged.includes('deployment_config_hash')) {}
   if (fieldsChanged.includes('schema_version')) {
     invalidatedAttestations.push('all_evidence_envelopes');
killedBy: detectDrift — with previous detects deployment_config_hash change
statusReason: expected [] to include 'deployment_provenance'

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:68:7
   if (fieldsChanged.includes('deployment_config_hash')) {
     invalidatedAttestations.push('deployment_provenance', 'sbom_attestation');
   }
-  if (fieldsChanged.includes('schema_version')) {
+  if (true) {
     invalidatedAttestations.push('all_evidence_envelopes');
   }
killedBy: detectDrift — no previous changed=false when previous is null
statusReason: expected [ 'all_evidence_envelopes' ] to have a length of +0 but got 1

[Survived] BlockStatement
lib/ccvs/drift-detector.ts:68:49
   if (fieldsChanged.includes('deployment_config_hash')) {
     invalidatedAttestations.push('deployment_provenance', 'sbom_attestation');
   }
-  if (fieldsChanged.includes('schema_version')) {
-    invalidatedAttestations.push('all_evidence_envelopes');
-  }
+  if (fieldsChanged.includes('schema_version')) {}
 
   return {

[Survived] StringLiteral
lib/ccvs/drift-detector.ts:69:34
     invalidatedAttestations.push('deployment_provenance', 'sbom_attestation');
   }
   if (fieldsChanged.includes('schema_version')) {
-    invalidatedAttestations.push('all_evidence_envelopes');
+    invalidatedAttestations.push("");
   }
 

[Killed] ObjectLiteral
lib/ccvs/drift-detector.ts:72:10
     invalidatedAttestations.push('all_evidence_envelopes');
   }
 
-  return {
-    changed,
-    fields_changed: fieldsChanged,
-    previous,
-    current,
-    invalidated_attestations: [...new Set(invalidatedAttestations)],
-  };
+  return {};
 }
 
killedBy: detectDrift — no previous changed=false when previous is null
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
lib/ccvs/drift-detector.ts:81:63
   };
 }
 
-export function snapshotHash(snapshot: DriftSnapshot): string {
-  const keys = Object.keys(snapshot).filter((k) => k !== 'captured_at').sort();
-  const stable = Object.fromEntries(keys.map((k) => [k, snapshot[k as keyof DriftSnapshot]]));
-  return 'sha256:' + sha256Hex(JSON.stringify(stable));
-}
+export function snapshotHash(snapshot: DriftSnapshot): string {}
 
killedBy: snapshotHash changes when policy_version changes
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:82:52
 }
 
 export function snapshotHash(snapshot: DriftSnapshot): string {
-  const keys = Object.keys(snapshot).filter((k) => k !== 'captured_at').sort();
+  const keys = Object.keys(snapshot).filter((k) => false).sort();
   const stable = Object.fromEntries(keys.map((k) => [k, snapshot[k as keyof DriftSnapshot]]));
   return 'sha256:' + sha256Hex(JSON.stringify(stable));
killedBy: snapshotHash changes when policy_version changes
statusReason: expected 'sha256:44136fa355b3678a1146ad16f7e864…' not to be 'sha256:44136fa355b3678a1146ad16f7e864…' // Object.is equality

[Killed] ConditionalExpression
lib/ccvs/drift-detector.ts:82:52
 }
 
 export function snapshotHash(snapshot: DriftSnapshot): string {
-  const keys = Object.keys(snapshot).filter((k) => k !== 'captured_at').sort();
+  const keys = Object.keys(snapshot).filter((k) => true).sort();
   const stable = Object.fromEntries(keys.map((k) => [k, snapshot[k as keyof DriftSnapshot]]));
   return 'sha256:' + sha256Hex(JSON.stringify(stable));
killedBy: snapshotHash is deterministic for the same snapshot content
statusReason: expected 'sha256:6b610de30cd9358c41a98ada844ed7…' to be 'sha256:53dd8d5e81a8531ceaa6b446402d49…' // Object.is equality

[Killed] ArrowFunction
lib/ccvs/drift-detector.ts:83:46
 
 export function snapshotHash(snapshot: DriftSnapshot): string {
   const keys = Object.keys(snapshot).filter((k) => k !== 'captured_at').sort();
-  const stable = Object.fromEntries(keys.map((k) => [k, snapshot[k as keyof DriftSnapshot]]));
+  const stable = Object.fromEntries(keys.map(() => undefined));
   return 'sha256:' + sha256Hex(JSON.stringify(stable));
 }
killedBy: snapshotHash is deterministic for the same snapshot content
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
lib/ccvs/drift-detector.ts:83:53
 
 export function snapshotHash(snapshot: DriftSnapshot): string {
   const keys = Object.keys(snapshot).filter((k) => k !== 'captured_at').sort();
-  const stable = Object.fromEntries(keys.map((k) => [k, snapshot[k as keyof DriftSnapshot]]));
+  const stable = Object.fromEntries(keys.map((k) => []));
   return 'sha256:' + sha256Hex(JSON.stringify(stable));
 }
killedBy: snapshotHash changes when policy_version changes
statusReason: expected 'sha256:44136fa355b3678a1146ad16f7e864…' not to be 'sha256:44136fa355b3678a1146ad16f7e864…' // Object.is equality
