[Killed] ObjectLiteral
lib/ccvs/evidence-collector.ts:16:79
 /** L1=basic unit, L2=integration, L3=adversarial, L4=cryptographic, L5=independently reproducible */
 export type EvidenceSeverityLevel = 1 | 2 | 3 | 4 | 5;
 
-export const EVIDENCE_SEVERITY: Record<EvidenceType, EvidenceSeverityLevel> = {
-  unit: 1,
-  integration: 2,
-  adversarial: 3,
-  replay: 3,
-  sbom: 3,
-  mutation: 4,
-  oversight: 4,
-  provenance: 5,
-};
+export const EVIDENCE_SEVERITY: Record<EvidenceType, EvidenceSeverityLevel> = {};
 
 export interface EvidenceSubject {
killedBy: buildEvidenceEnvelope sets severity_level from evidence type
statusReason: expected undefined to be 4 // Object.is equality

[Killed] StringLiteral
lib/ccvs/evidence-collector.ts:108:28
 }
 
 function sha256Hex(data: string): string {
-  return crypto.createHash('sha256').update(data, 'utf8').digest('hex');
+  return crypto.createHash("").update(data, 'utf8').digest('hex');
 }
 
killedBy: buildEvidenceEnvelope produces schema_version 1.0.0
statusReason: Digest method not supported

[Survived] StringLiteral
lib/ccvs/evidence-collector.ts:108:51
 }
 
 function sha256Hex(data: string): string {
-  return crypto.createHash('sha256').update(data, 'utf8').digest('hex');
+  return crypto.createHash('sha256').update(data, "").digest('hex');
 }
 

[Killed] BlockStatement
lib/ccvs/evidence-collector.ts:111:45
   return crypto.createHash('sha256').update(data, 'utf8').digest('hex');
 }
 
-function canonicalize(obj: unknown): string {
-  if (obj === null || typeof obj !== 'object') return JSON.stringify(obj);
-  if (Array.isArray(obj)) return '[' + obj.map(canonicalize).join(',') + ']';
-  const keys = Object.keys(obj as object).sort();
-  return '{' + keys.map((k) => JSON.stringify(k) + ':' + canonicalize((obj as Record<string, unknown>)[k])).join(',') + '}';
-}
+function canonicalize(obj: unknown): string {}
 
 export function buildEvidenceEnvelope(opts: CollectorOptions): CCVSEvidenceEnvelope {
killedBy: buildEvidenceEnvelope produces schema_version 1.0.0
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] ConditionalExpression
lib/ccvs/evidence-collector.ts:112:7
 }
 
 function canonicalize(obj: unknown): string {
-  if (obj === null || typeof obj !== 'object') return JSON.stringify(obj);
+  if (false) return JSON.stringify(obj);
   if (Array.isArray(obj)) return '[' + obj.map(canonicalize).join(',') + ']';
   const keys = Object.keys(obj as object).sort();
killedBy: buildEvidenceEnvelope produces schema_version 1.0.0
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
lib/ccvs/evidence-collector.ts:112:23
 }
 
 function canonicalize(obj: unknown): string {
-  if (obj === null || typeof obj !== 'object') return JSON.stringify(obj);
+  if (obj === null || false) return JSON.stringify(obj);
   if (Array.isArray(obj)) return '[' + obj.map(canonicalize).join(',') + ']';
   const keys = Object.keys(obj as object).sort();
killedBy: buildEvidenceEnvelope produces schema_version 1.0.0
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
lib/ccvs/evidence-collector.ts:113:7
 
 function canonicalize(obj: unknown): string {
   if (obj === null || typeof obj !== 'object') return JSON.stringify(obj);
-  if (Array.isArray(obj)) return '[' + obj.map(canonicalize).join(',') + ']';
+  if (true) return '[' + obj.map(canonicalize).join(',') + ']';
   const keys = Object.keys(obj as object).sort();
   return '{' + keys.map((k) => JSON.stringify(k) + ':' + canonicalize((obj as Record<string, unknown>)[k])).join(',') + '}';
killedBy: buildEvidenceEnvelope produces schema_version 1.0.0
statusReason: obj.map is not a function

[Survived] ConditionalExpression
lib/ccvs/evidence-collector.ts:113:7
 
 function canonicalize(obj: unknown): string {
   if (obj === null || typeof obj !== 'object') return JSON.stringify(obj);
-  if (Array.isArray(obj)) return '[' + obj.map(canonicalize).join(',') + ']';
+  if (false) return '[' + obj.map(canonicalize).join(',') + ']';
   const keys = Object.keys(obj as object).sort();
   return '{' + keys.map((k) => JSON.stringify(k) + ':' + canonicalize((obj as Record<string, unknown>)[k])).join(',') + '}';

[Survived] MethodExpression
lib/ccvs/evidence-collector.ts:114:16
 function canonicalize(obj: unknown): string {
   if (obj === null || typeof obj !== 'object') return JSON.stringify(obj);
   if (Array.isArray(obj)) return '[' + obj.map(canonicalize).join(',') + ']';
-  const keys = Object.keys(obj as object).sort();
+  const keys = Object.keys(obj as object);
   return '{' + keys.map((k) => JSON.stringify(k) + ':' + canonicalize((obj as Record<string, unknown>)[k])).join(',') + '}';
 }

[Killed] ArrowFunction
lib/ccvs/evidence-collector.ts:115:25
   if (obj === null || typeof obj !== 'object') return JSON.stringify(obj);
   if (Array.isArray(obj)) return '[' + obj.map(canonicalize).join(',') + ']';
   const keys = Object.keys(obj as object).sort();
-  return '{' + keys.map((k) => JSON.stringify(k) + ':' + canonicalize((obj as Record<string, unknown>)[k])).join(',') + '}';
+  return '{' + keys.map(() => undefined).join(',') + '}';
 }
 
killedBy: buildEvidenceEnvelope chain_hash changes when metrics change
statusReason: expected 'sha256:9701a2e9e62ad90a9bc41574a9f9f4…' not to be 'sha256:9701a2e9e62ad90a9bc41574a9f9f4…' // Object.is equality

[Survived] StringLiteral
lib/ccvs/evidence-collector.ts:115:52
   if (obj === null || typeof obj !== 'object') return JSON.stringify(obj);
   if (Array.isArray(obj)) return '[' + obj.map(canonicalize).join(',') + ']';
   const keys = Object.keys(obj as object).sort();
-  return '{' + keys.map((k) => JSON.stringify(k) + ':' + canonicalize((obj as Record<string, unknown>)[k])).join(',') + '}';
+  return '{' + keys.map((k) => JSON.stringify(k) + "" + canonicalize((obj as Record<string, unknown>)[k])).join(',') + '}';
 }
 

[Killed] ArithmeticOperator
lib/ccvs/evidence-collector.ts:121:16
 export function buildEvidenceEnvelope(opts: CollectorOptions): CCVSEvidenceEnvelope {
   const generatedAt = new Date().toISOString();
   const expiresAt = opts.ttlSeconds
-    ? new Date(Date.now() + opts.ttlSeconds * 1000).toISOString()
+    ? new Date(Date.now() - opts.ttlSeconds * 1000).toISOString()
     : undefined;
 
killedBy: buildEvidenceEnvelope sets expires_at when ttlSeconds provided
statusReason: expected 1779984399560 to be greater than 1779987999561

[Survived] ArithmeticOperator
lib/ccvs/evidence-collector.ts:121:29
 export function buildEvidenceEnvelope(opts: CollectorOptions): CCVSEvidenceEnvelope {
   const generatedAt = new Date().toISOString();
   const expiresAt = opts.ttlSeconds
-    ? new Date(Date.now() + opts.ttlSeconds * 1000).toISOString()
+    ? new Date(Date.now() + opts.ttlSeconds / 1000).toISOString()
     : undefined;
 

[Killed] ObjectLiteral
lib/ccvs/evidence-collector.ts:124:42
     ? new Date(Date.now() + opts.ttlSeconds * 1000).toISOString()
     : undefined;
 
-  const envelope: CCVSEvidenceEnvelope = {
-    schema_version: '1.0.0',
-    evidence_type: opts.evidenceType,
-    severity_level: EVIDENCE_SEVERITY[opts.evidenceType],
-    subject: opts.subjects,
-    run: opts.run,
-    oidc: opts.oidc,
-    metrics: opts.metrics ?? {},
-    integrity: {
-      previous_chain_hash: opts.previousChainHash ?? '',
-      chain_hash: '',
-      ...(opts.sbomRef ? { sbom_ref: opts.sbomRef } : {}),
-      ...(opts.bundleRef ? { bundle_ref: opts.bundleRef } : {}),
-      ...(opts.verificationPolicyRef ? { verification_policy_ref: opts.verificationPolicyRef } : {}),
-    },
-    policy_version: opts.policyVersion ?? 'v1',
-    ...(opts.nonce ? { nonce: opts.nonce } : {}),
-    ...(expiresAt ? { expires_at: expiresAt } : {}),
-    generated_at: generatedAt,
-  };
+  const envelope: CCVSEvidenceEnvelope = {};
 
   const withoutHash = { ...envelope, integrity: { ...envelope.integrity, chain_hash: '' } };
killedBy: buildEvidenceEnvelope produces schema_version 1.0.0
statusReason: Cannot set properties of undefined (setting 'chain_hash')

[Killed] LogicalOperator
lib/ccvs/evidence-collector.ts:131:14
     subject: opts.subjects,
     run: opts.run,
     oidc: opts.oidc,
-    metrics: opts.metrics ?? {},
+    metrics: opts.metrics && {},
     integrity: {
       previous_chain_hash: opts.previousChainHash ?? '',
killedBy: buildEvidenceEnvelope chain_hash changes when metrics change
statusReason: expected 'sha256:53a8ed306b162386e0d2b5a4a0feb6…' not to be 'sha256:53a8ed306b162386e0d2b5a4a0feb6…' // Object.is equality

[Killed] LogicalOperator
lib/ccvs/evidence-collector.ts:133:28
     oidc: opts.oidc,
     metrics: opts.metrics ?? {},
     integrity: {
-      previous_chain_hash: opts.previousChainHash ?? '',
+      previous_chain_hash: opts.previousChainHash && '',
       chain_hash: '',
       ...(opts.sbomRef ? { sbom_ref: opts.sbomRef } : {}),
killedBy: buildEvidenceEnvelope carries previous_chain_hash when supplied
statusReason: expected '' to be 'sha256:aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa…' // Object.is equality

[Killed] ObjectLiteral
lib/ccvs/evidence-collector.ts:135:26
     integrity: {
       previous_chain_hash: opts.previousChainHash ?? '',
       chain_hash: '',
-      ...(opts.sbomRef ? { sbom_ref: opts.sbomRef } : {}),
+      ...(opts.sbomRef ? {} : {}),
       ...(opts.bundleRef ? { bundle_ref: opts.bundleRef } : {}),
       ...(opts.verificationPolicyRef ? { verification_policy_ref: opts.verificationPolicyRef } : {}),
killedBy: buildEvidenceEnvelope includes sbom_ref when provided
statusReason: expected undefined to be 'sbom.cyclonedx.json' // Object.is equality

[Survived] LogicalOperator
lib/ccvs/evidence-collector.ts:139:21
       ...(opts.bundleRef ? { bundle_ref: opts.bundleRef } : {}),
       ...(opts.verificationPolicyRef ? { verification_policy_ref: opts.verificationPolicyRef } : {}),
     },
-    policy_version: opts.policyVersion ?? 'v1',
+    policy_version: opts.policyVersion && 'v1',
     ...(opts.nonce ? { nonce: opts.nonce } : {}),
     ...(expiresAt ? { expires_at: expiresAt } : {}),

[Survived] StringLiteral
lib/ccvs/evidence-collector.ts:139:43
       ...(opts.bundleRef ? { bundle_ref: opts.bundleRef } : {}),
       ...(opts.verificationPolicyRef ? { verification_policy_ref: opts.verificationPolicyRef } : {}),
     },
-    policy_version: opts.policyVersion ?? 'v1',
+    policy_version: opts.policyVersion ?? "",
     ...(opts.nonce ? { nonce: opts.nonce } : {}),
     ...(expiresAt ? { expires_at: expiresAt } : {}),

[Killed] ObjectLiteral
lib/ccvs/evidence-collector.ts:145:23
     generated_at: generatedAt,
   };
 
-  const withoutHash = { ...envelope, integrity: { ...envelope.integrity, chain_hash: '' } };
+  const withoutHash = {};
   const canonical = canonicalize(withoutHash);
   const digest = sha256Hex(canonical);
killedBy: buildEvidenceEnvelope chain_hash changes when metrics change
statusReason: expected 'sha256:44136fa355b3678a1146ad16f7e864…' not to be 'sha256:44136fa355b3678a1146ad16f7e864…' // Object.is equality

[Killed] BlockStatement
lib/ccvs/evidence-collector.ts:153:108
   return envelope;
 }
 
-export function verifyEnvelopeIntegrity(envelope: CCVSEvidenceEnvelope): { ok: boolean; expected: string } {
-  const withoutHash = { ...envelope, integrity: { ...envelope.integrity, chain_hash: '' } };
-  const canonical = canonicalize(withoutHash);
-  const expected = 'sha256:' + sha256Hex(canonical);
-  return { ok: envelope.integrity.chain_hash === expected, expected };
-}
+export function verifyEnvelopeIntegrity(envelope: CCVSEvidenceEnvelope): { ok: boolean; expected: string } {}
 
 export function buildRunContextFromEnv(): EvidenceRunContext {
killedBy: verifyEnvelopeIntegrity returns ok=true for a freshly built envelope
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ObjectLiteral
lib/ccvs/evidence-collector.ts:154:49
 }
 
 export function verifyEnvelopeIntegrity(envelope: CCVSEvidenceEnvelope): { ok: boolean; expected: string } {
-  const withoutHash = { ...envelope, integrity: { ...envelope.integrity, chain_hash: '' } };
+  const withoutHash = { ...envelope, integrity: {} };
   const canonical = canonicalize(withoutHash);
   const expected = 'sha256:' + sha256Hex(canonical);
killedBy: verifyEnvelopeIntegrity returns ok=true for a freshly built envelope
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/ccvs/evidence-collector.ts:157:16
   const withoutHash = { ...envelope, integrity: { ...envelope.integrity, chain_hash: '' } };
   const canonical = canonicalize(withoutHash);
   const expected = 'sha256:' + sha256Hex(canonical);
-  return { ok: envelope.integrity.chain_hash === expected, expected };
+  return { ok: false, expected };
 }
 
killedBy: verifyEnvelopeIntegrity returns ok=true for a freshly built envelope
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/ccvs/evidence-collector.ts:157:16
   const withoutHash = { ...envelope, integrity: { ...envelope.integrity, chain_hash: '' } };
   const canonical = canonicalize(withoutHash);
   const expected = 'sha256:' + sha256Hex(canonical);
-  return { ok: envelope.integrity.chain_hash === expected, expected };
+  return { ok: envelope.integrity.chain_hash !== expected, expected };
 }
 
killedBy: verifyEnvelopeIntegrity returns ok=true for a freshly built envelope
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/ccvs/evidence-collector.ts:160:62
   return { ok: envelope.integrity.chain_hash === expected, expected };
 }
 
-export function buildRunContextFromEnv(): EvidenceRunContext {
-  const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
-  const commit = process.env.GITHUB_SHA ?? 'unknown';
-  const ref = process.env.GITHUB_REF;
-  const runId = process.env.GITHUB_RUN_ID ?? 'local-' + Date.now();
-  const attempt = process.env.GITHUB_RUN_ATTEMPT ?? '1';
-
-  return {
-    repo,
-    commit,
-    ...(ref ? { ref } : {}),
-    workflow_run_id: runId,
-    builder_id: 'https://github.com/actions/runner',
-    invocation_id: runId + '-' + attempt,
-    ...(process.env.RUNNER_OS ? { runner_os: process.env.RUNNER_OS } : {}),
-  };
-}
+export function buildRunContextFromEnv(): EvidenceRunContext {}
 
 export function buildOIDCFromEnv(audience = 'ccvs-evidence'): EvidenceOIDC {
killedBy: buildRunContextFromEnv reads repo and commit from env
statusReason: Cannot read properties of undefined (reading 'repo')

[Killed] LogicalOperator
lib/ccvs/evidence-collector.ts:161:16
 }
 
 export function buildRunContextFromEnv(): EvidenceRunContext {
-  const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
+  const repo = process.env.GITHUB_REPOSITORY && 'local/unknown';
   const commit = process.env.GITHUB_SHA ?? 'unknown';
   const ref = process.env.GITHUB_REF;
killedBy: buildRunContextFromEnv reads repo and commit from env
statusReason: expected 'local/unknown' to be 'test-org/test-repo' // Object.is equality

[NoCoverage] StringLiteral
lib/ccvs/evidence-collector.ts:161:49
 }
 
 export function buildRunContextFromEnv(): EvidenceRunContext {
-  const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
+  const repo = process.env.GITHUB_REPOSITORY ?? "";
   const commit = process.env.GITHUB_SHA ?? 'unknown';
   const ref = process.env.GITHUB_REF;

[Killed] LogicalOperator
lib/ccvs/evidence-collector.ts:162:18
 
 export function buildRunContextFromEnv(): EvidenceRunContext {
   const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
-  const commit = process.env.GITHUB_SHA ?? 'unknown';
+  const commit = process.env.GITHUB_SHA && 'unknown';
   const ref = process.env.GITHUB_REF;
   const runId = process.env.GITHUB_RUN_ID ?? 'local-' + Date.now();
killedBy: buildRunContextFromEnv reads repo and commit from env
statusReason: expected 'unknown' to be 'def5678' // Object.is equality

[Killed] LogicalOperator
lib/ccvs/evidence-collector.ts:164:17
   const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
   const commit = process.env.GITHUB_SHA ?? 'unknown';
   const ref = process.env.GITHUB_REF;
-  const runId = process.env.GITHUB_RUN_ID ?? 'local-' + Date.now();
+  const runId = process.env.GITHUB_RUN_ID && 'local-' + Date.now();
   const attempt = process.env.GITHUB_RUN_ATTEMPT ?? '1';
 
killedBy: buildRunContextFromEnv builds invocation_id from run_id + attempt
statusReason: expected 'local-1779988003501-1' to be '12345-1' // Object.is equality

[NoCoverage] StringLiteral
lib/ccvs/evidence-collector.ts:164:46
   const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
   const commit = process.env.GITHUB_SHA ?? 'unknown';
   const ref = process.env.GITHUB_REF;
-  const runId = process.env.GITHUB_RUN_ID ?? 'local-' + Date.now();
+  const runId = process.env.GITHUB_RUN_ID ?? "" + Date.now();
   const attempt = process.env.GITHUB_RUN_ATTEMPT ?? '1';
 

[Survived] LogicalOperator
lib/ccvs/evidence-collector.ts:165:19
   const commit = process.env.GITHUB_SHA ?? 'unknown';
   const ref = process.env.GITHUB_REF;
   const runId = process.env.GITHUB_RUN_ID ?? 'local-' + Date.now();
-  const attempt = process.env.GITHUB_RUN_ATTEMPT ?? '1';
+  const attempt = process.env.GITHUB_RUN_ATTEMPT && '1';
 
   return {

[Killed] BlockStatement
lib/ccvs/evidence-collector.ts:178:76
   };
 }
 
-export function buildOIDCFromEnv(audience = 'ccvs-evidence'): EvidenceOIDC {
-  const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
-  const ref = process.env.GITHUB_REF ?? '';
-  return {
-    issuer: 'https://token.actions.githubusercontent.com',
-    audience,
-    sub: 'repo:' + repo + ':ref:' + ref,
-    repository: repo,
-    ref,
-  };
-}
+export function buildOIDCFromEnv(audience = 'ccvs-evidence'): EvidenceOIDC {}
 
killedBy: buildOIDCFromEnv builds sub from repo + ref
statusReason: Cannot read properties of undefined (reading 'sub')

[Killed] LogicalOperator
lib/ccvs/evidence-collector.ts:179:16
 }
 
 export function buildOIDCFromEnv(audience = 'ccvs-evidence'): EvidenceOIDC {
-  const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
+  const repo = process.env.GITHUB_REPOSITORY && 'local/unknown';
   const ref = process.env.GITHUB_REF ?? '';
   return {
killedBy: buildOIDCFromEnv builds sub from repo + ref
statusReason: expected 'repo:local/unknown:ref:refs/heads/fea…' to be 'repo:test-org/test-repo:ref:refs/head…' // Object.is equality

[Killed] LogicalOperator
lib/ccvs/evidence-collector.ts:180:15
 
 export function buildOIDCFromEnv(audience = 'ccvs-evidence'): EvidenceOIDC {
   const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
-  const ref = process.env.GITHUB_REF ?? '';
+  const ref = process.env.GITHUB_REF && '';
   return {
     issuer: 'https://token.actions.githubusercontent.com',
killedBy: buildOIDCFromEnv builds sub from repo + ref
statusReason: expected 'repo:test-org/test-repo:ref:' to be 'repo:test-org/test-repo:ref:refs/head…' // Object.is equality

[Survived] StringLiteral
lib/ccvs/evidence-collector.ts:182:13
   const repo = process.env.GITHUB_REPOSITORY ?? 'local/unknown';
   const ref = process.env.GITHUB_REF ?? '';
   return {
-    issuer: 'https://token.actions.githubusercontent.com',
+    issuer: "",
     audience,
     sub: 'repo:' + repo + ':ref:' + ref,

[Killed] StringLiteral
lib/ccvs/evidence-collector.ts:184:10
   return {
     issuer: 'https://token.actions.githubusercontent.com',
     audience,
-    sub: 'repo:' + repo + ':ref:' + ref,
+    sub: "" + repo + ':ref:' + ref,
     repository: repo,
     ref,
killedBy: buildOIDCFromEnv builds sub from repo + ref
statusReason: expected 'test-org/test-repo:ref:refs/heads/fea…' to be 'repo:test-org/test-repo:ref:refs/head…' // Object.is equality

[Killed] StringLiteral
lib/ccvs/evidence-collector.ts:184:27
   return {
     issuer: 'https://token.actions.githubusercontent.com',
     audience,
-    sub: 'repo:' + repo + ':ref:' + ref,
+    sub: 'repo:' + repo + "" + ref,
     repository: repo,
     ref,
killedBy: buildOIDCFromEnv builds sub from repo + ref
statusReason: expected 'repo:test-org/test-reporefs/heads/fea…' to be 'repo:test-org/test-repo:ref:refs/head…' // Object.is equality
