[Killed] BlockStatement
lib/spine/pipeline.ts:6:32
 import type { Decision, PipelineResult, PluginOutput, PluginInput } from './types';
 
 export class SpineInfraError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = 'SpineInfraError';
-  }
+  constructor(message: string) {}
 }
 
killedBy: SpineInfraError is an instance of Error
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
lib/spine/pipeline.ts:12:47
   }
 }
 
-function severity(decision: Decision): number {
-  const severities: Record<Decision, number> = { ALLOW: 0, STABILIZE: 1, BLOCK: 2 };
-  return severities[decision];
-}
+function severity(decision: Decision): number {}
 
 function combineDecision(left: Decision, right: Decision): Decision {
killedBy: runPipeline — gate BLOCK short-circuits arbiters ALLOW from gate lets arbiter escalate to STABILIZE
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] BlockStatement
lib/spine/pipeline.ts:17:69
   return severities[decision];
 }
 
-function combineDecision(left: Decision, right: Decision): Decision {
-  return severity(left) >= severity(right) ? left : right;
-}
+function combineDecision(left: Decision, right: Decision): Decision {}
 
 function defaultProof(): PluginOutput['proof'] {
killedBy: runPipeline — gate BLOCK short-circuits arbiters ALLOW from gate lets arbiter escalate to STABILIZE
statusReason: expected undefined to be 'STABILIZE' // Object.is equality

[Killed] EqualityOperator
lib/spine/pipeline.ts:18:10
 }
 
 function combineDecision(left: Decision, right: Decision): Decision {
-  return severity(left) >= severity(right) ? left : right;
+  return severity(left) < severity(right) ? left : right;
 }
 
killedBy: runPipeline — gate BLOCK short-circuits arbiters ALLOW from gate lets arbiter escalate to STABILIZE
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] ConditionalExpression
lib/spine/pipeline.ts:18:10
 }
 
 function combineDecision(left: Decision, right: Decision): Decision {
-  return severity(left) >= severity(right) ? left : right;
+  return true ? left : right;
 }
 
killedBy: runPipeline — gate BLOCK short-circuits arbiters ALLOW from gate lets arbiter escalate to STABILIZE
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Survived] BlockStatement
lib/spine/pipeline.ts:21:48
   return severity(left) >= severity(right) ? left : right;
 }
 
-function defaultProof(): PluginOutput['proof'] {
-  return {
-    proof_hash: null,
-    proof_version: null,
-    theorem_set_id: null,
-    solver: null,
-  };
-}
+function defaultProof(): PluginOutput['proof'] {}
 
 function pluginError(pluginId: string, error: unknown): PluginOutput {

[NoCoverage] BlockStatement
lib/spine/pipeline.ts:30:70
   };
 }
 
-function pluginError(pluginId: string, error: unknown): PluginOutput {
-  return {
-    decision: 'BLOCK',
-    reason: `${pluginId}:PLUGIN_EVALUATION_ERROR`,
-    policy_version: `${pluginId}:error`,
-    latency_ms: 0,
-    proof: defaultProof(),
-    metrics: {
-      error: error instanceof Error ? error.message : 'unknown',
-    },
-  };
-}
+function pluginError(pluginId: string, error: unknown): PluginOutput {}
 
 export async function runPipeline(input: PluginInput): Promise<PipelineResult> {

[NoCoverage] StringLiteral
lib/spine/pipeline.ts:38:55
     latency_ms: 0,
     proof: defaultProof(),
     metrics: {
-      error: error instanceof Error ? error.message : 'unknown',
+      error: error instanceof Error ? error.message : "",
     },
   };

[Survived] StringLiteral
lib/spine/pipeline.ts:48:21
 
   const stages: PipelineResult['stages'] = [];
   let finalDecision: Decision = 'ALLOW';
-  let finalReason = 'ALLOW';
+  let finalReason = "";
   let finalPolicyVersion = 'spine-unset';
   let authoritativePluginId = 'none';

[Killed] ConditionalExpression
lib/spine/pipeline.ts:54:18
   let authoritativeProof = defaultProof();
   let totalLatency = 0;
 
-  const gateId = process.env.DSG_SPINE_GATE_PLUGIN || 'dsg-gate-bridge-v1';
+  const gateId = true;
   const gatePlugin = registry.get(gateId);
   if (!gatePlugin) {
killedBy: runPipeline — gate BLOCK short-circuits arbiters returns BLOCK from gate and skips arbiters
statusReason: GATE_PLUGIN_NOT_FOUND

[Killed] LogicalOperator
lib/spine/pipeline.ts:54:18
   let authoritativeProof = defaultProof();
   let totalLatency = 0;
 
-  const gateId = process.env.DSG_SPINE_GATE_PLUGIN || 'dsg-gate-bridge-v1';
+  const gateId = process.env.DSG_SPINE_GATE_PLUGIN && 'dsg-gate-bridge-v1';
   const gatePlugin = registry.get(gateId);
   if (!gatePlugin) {
killedBy: runPipeline — gate BLOCK short-circuits arbiters returns BLOCK from gate and skips arbiters
statusReason: expected 'dsg-gate-bridge-v1:PLUGIN_EVALUATION_…' to be 'test:HIGH_RISK' // Object.is equality

[Killed] ConditionalExpression
lib/spine/pipeline.ts:56:7
 
   const gateId = process.env.DSG_SPINE_GATE_PLUGIN || 'dsg-gate-bridge-v1';
   const gatePlugin = registry.get(gateId);
-  if (!gatePlugin) {
+  if (false) {
     throw new SpineInfraError('GATE_PLUGIN_NOT_FOUND');
   }
killedBy: runPipeline — SpineInfraError cases throws SpineInfraError when gate plugin is not found
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of SpineInfraError

[Killed] BooleanLiteral
lib/spine/pipeline.ts:56:7
 
   const gateId = process.env.DSG_SPINE_GATE_PLUGIN || 'dsg-gate-bridge-v1';
   const gatePlugin = registry.get(gateId);
-  if (!gatePlugin) {
+  if (gatePlugin) {
     throw new SpineInfraError('GATE_PLUGIN_NOT_FOUND');
   }
killedBy: runPipeline — gate BLOCK short-circuits arbiters returns BLOCK from gate and skips arbiters
statusReason: GATE_PLUGIN_NOT_FOUND

[Killed] BlockStatement
lib/spine/pipeline.ts:59:35
   if (!gatePlugin) {
     throw new SpineInfraError('GATE_PLUGIN_NOT_FOUND');
   }
-  if (gatePlugin.kind !== 'gate') {
-    throw new SpineInfraError('GATE_PLUGIN_INVALID_KIND');
-  }
+  if (gatePlugin.kind !== 'gate') {}
 
   const gateOutput = await gatePlugin.evaluate(input).catch((error) => pluginError(gatePlugin.id, error));
killedBy: runPipeline — SpineInfraError cases throws SpineInfraError when registered plugin has wrong kind
statusReason: promise resolved "{ final_decision: 'ALLOW', …(6) }" instead of rejecting

[Killed] EqualityOperator
lib/spine/pipeline.ts:59:7
   if (!gatePlugin) {
     throw new SpineInfraError('GATE_PLUGIN_NOT_FOUND');
   }
-  if (gatePlugin.kind !== 'gate') {
+  if (gatePlugin.kind === 'gate') {
     throw new SpineInfraError('GATE_PLUGIN_INVALID_KIND');
   }
killedBy: runPipeline — SpineInfraError cases throws SpineInfraError when registered plugin has wrong kind
statusReason: promise resolved "{ final_decision: 'ALLOW', …(6) }" instead of rejecting

[Survived] ArrowFunction
lib/spine/pipeline.ts:63:61
     throw new SpineInfraError('GATE_PLUGIN_INVALID_KIND');
   }
 
-  const gateOutput = await gatePlugin.evaluate(input).catch((error) => pluginError(gatePlugin.id, error));
+  const gateOutput = await gatePlugin.evaluate(input).catch(() => undefined);
   totalLatency += gateOutput.latency_ms;
   finalDecision = gateOutput.decision;

[Survived] AssignmentOperator
lib/spine/pipeline.ts:64:3
   }
 
   const gateOutput = await gatePlugin.evaluate(input).catch((error) => pluginError(gatePlugin.id, error));
-  totalLatency += gateOutput.latency_ms;
+  totalLatency -= gateOutput.latency_ms;
   finalDecision = gateOutput.decision;
   finalReason = gateOutput.reason;

[Killed] ObjectLiteral
lib/spine/pipeline.ts:70:15
   finalPolicyVersion = gateOutput.policy_version;
   authoritativePluginId = gatePlugin.id;
   authoritativeProof = gateOutput.proof;
-  stages.push({
-    plugin_id: gatePlugin.id,
-    decision: gateOutput.decision,
-    reason: gateOutput.reason,
-    latency_ms: gateOutput.latency_ms,
-    proof_hash: gateOutput.proof.proof_hash,
-  });
+  stages.push({});
 
   if (gateOutput.decision !== 'BLOCK') {
killedBy: runPipeline — gate BLOCK short-circuits arbiters returns BLOCK from gate and skips arbiters
statusReason: expected undefined to be 'test-block-gate' // Object.is equality

[Killed] ConditionalExpression
lib/spine/pipeline.ts:78:7
     proof_hash: gateOutput.proof.proof_hash,
   });
 
-  if (gateOutput.decision !== 'BLOCK') {
+  if (false) {
     const arbiters = registry.getByKind('arbiter').sort((a, b) => a.id.localeCompare(b.id));
     for (const arbiter of arbiters) {
killedBy: runPipeline — gate BLOCK short-circuits arbiters ALLOW from gate lets arbiter escalate to STABILIZE
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] BlockStatement
lib/spine/pipeline.ts:78:40
     proof_hash: gateOutput.proof.proof_hash,
   });
 
-  if (gateOutput.decision !== 'BLOCK') {
-    const arbiters = registry.getByKind('arbiter').sort((a, b) => a.id.localeCompare(b.id));
-    for (const arbiter of arbiters) {
-      const output = await arbiter.evaluate(input).catch((error) => pluginError(arbiter.id, error));
-      totalLatency += output.latency_ms;
-      stages.push({
-        plugin_id: arbiter.id,
-        decision: output.decision,
-        reason: output.reason,
-        latency_ms: output.latency_ms,
-        proof_hash: output.proof.proof_hash,
-      });
-
-      const combined = combineDecision(finalDecision, output.decision);
-      if (combined !== finalDecision && severity(output.decision) >= severity(finalDecision)) {
-        finalDecision = combined;
-        finalReason = output.reason;
-        finalPolicyVersion = output.policy_version;
-        authoritativePluginId = arbiter.id;
-        authoritativeProof = output.proof;
-      }
-    }
-  }
+  if (gateOutput.decision !== 'BLOCK') {}
 
   return {
killedBy: runPipeline — gate BLOCK short-circuits arbiters ALLOW from gate lets arbiter escalate to STABILIZE
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Survived] ArrowFunction
lib/spine/pipeline.ts:79:57
   });
 
   if (gateOutput.decision !== 'BLOCK') {
-    const arbiters = registry.getByKind('arbiter').sort((a, b) => a.id.localeCompare(b.id));
+    const arbiters = registry.getByKind('arbiter').sort(() => undefined);
     for (const arbiter of arbiters) {
       const output = await arbiter.evaluate(input).catch((error) => pluginError(arbiter.id, error));

[Survived] MethodExpression
lib/spine/pipeline.ts:79:22
   });
 
   if (gateOutput.decision !== 'BLOCK') {
-    const arbiters = registry.getByKind('arbiter').sort((a, b) => a.id.localeCompare(b.id));
+    const arbiters = registry.getByKind('arbiter');
     for (const arbiter of arbiters) {
       const output = await arbiter.evaluate(input).catch((error) => pluginError(arbiter.id, error));

[Killed] BlockStatement
lib/spine/pipeline.ts:80:37
 
   if (gateOutput.decision !== 'BLOCK') {
     const arbiters = registry.getByKind('arbiter').sort((a, b) => a.id.localeCompare(b.id));
-    for (const arbiter of arbiters) {
-      const output = await arbiter.evaluate(input).catch((error) => pluginError(arbiter.id, error));
-      totalLatency += output.latency_ms;
-      stages.push({
-        plugin_id: arbiter.id,
-        decision: output.decision,
-        reason: output.reason,
-        latency_ms: output.latency_ms,
-        proof_hash: output.proof.proof_hash,
-      });
-
-      const combined = combineDecision(finalDecision, output.decision);
-      if (combined !== finalDecision && severity(output.decision) >= severity(finalDecision)) {
-        finalDecision = combined;
-        finalReason = output.reason;
-        finalPolicyVersion = output.policy_version;
-        authoritativePluginId = arbiter.id;
-        authoritativeProof = output.proof;
-      }
-    }
+    for (const arbiter of arbiters) {}
   }
 
killedBy: runPipeline — gate BLOCK short-circuits arbiters ALLOW from gate lets arbiter escalate to STABILIZE
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Survived] ArrowFunction
lib/spine/pipeline.ts:81:58
   if (gateOutput.decision !== 'BLOCK') {
     const arbiters = registry.getByKind('arbiter').sort((a, b) => a.id.localeCompare(b.id));
     for (const arbiter of arbiters) {
-      const output = await arbiter.evaluate(input).catch((error) => pluginError(arbiter.id, error));
+      const output = await arbiter.evaluate(input).catch(() => undefined);
       totalLatency += output.latency_ms;
       stages.push({

[Survived] AssignmentOperator
lib/spine/pipeline.ts:82:7
     const arbiters = registry.getByKind('arbiter').sort((a, b) => a.id.localeCompare(b.id));
     for (const arbiter of arbiters) {
       const output = await arbiter.evaluate(input).catch((error) => pluginError(arbiter.id, error));
-      totalLatency += output.latency_ms;
+      totalLatency -= output.latency_ms;
       stages.push({
         plugin_id: arbiter.id,

[Killed] BlockStatement
lib/spine/pipeline.ts:92:95
       });
 
       const combined = combineDecision(finalDecision, output.decision);
-      if (combined !== finalDecision && severity(output.decision) >= severity(finalDecision)) {
-        finalDecision = combined;
-        finalReason = output.reason;
-        finalPolicyVersion = output.policy_version;
-        authoritativePluginId = arbiter.id;
-        authoritativeProof = output.proof;
-      }
+      if (combined !== finalDecision && severity(output.decision) >= severity(finalDecision)) {}
     }
   }
killedBy: runPipeline — gate BLOCK short-circuits arbiters ALLOW from gate lets arbiter escalate to STABILIZE
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] ConditionalExpression
lib/spine/pipeline.ts:92:11
       });
 
       const combined = combineDecision(finalDecision, output.decision);
-      if (combined !== finalDecision && severity(output.decision) >= severity(finalDecision)) {
+      if (true) {
         finalDecision = combined;
         finalReason = output.reason;
killedBy: runPipeline — initial string literal state ALLOW gate with no arbiters: final_decision is ALLOW, final_reason is gate reason
statusReason: expected 'SAMMA' to be 'gate:CLEAR' // Object.is equality

[Killed] ObjectLiteral
lib/spine/pipeline.ts:102:10
     }
   }
 
-  return {
-    final_decision: finalDecision,
-    final_reason: finalReason,
-    final_policy_version: finalPolicyVersion,
-    total_latency_ms: totalLatency,
-    proof: authoritativeProof,
-    authoritative_plugin_id: authoritativePluginId,
-    stages,
-  };
+  return {};
 }
 
killedBy: runPipeline — gate BLOCK short-circuits arbiters returns BLOCK from gate and skips arbiters
statusReason: expected undefined to be 'BLOCK' // Object.is equality
