[Survived] ArrayDeclaration
lib/runtime/gate.ts:23:32
 };
 
 export function detectOscillation(
-  recentRiskScores: number[] = [],
+  recentRiskScores: number[] = ["Stryker was here"],
   policy: GatePolicy = DEFAULT_POLICY
 ): boolean {

[Killed] BlockStatement
lib/runtime/gate.ts:25:12
 export function detectOscillation(
   recentRiskScores: number[] = [],
   policy: GatePolicy = DEFAULT_POLICY
-): boolean {
-  if (recentRiskScores.length < policy.oscillationWindow) {
-    return false;
-  }
-
-  const window = recentRiskScores.slice(-policy.oscillationWindow);
-  const min = Math.min(...window);
-  const max = Math.max(...window);
-  return max - min >= policy.oscillationSpread;
-}
+): boolean {}
 
 export function evaluateGate(
killedBy: evaluateGate — decision boundaries STABILIZE on oscillation even with low riskScore
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] EqualityOperator
lib/runtime/gate.ts:26:7
   recentRiskScores: number[] = [],
   policy: GatePolicy = DEFAULT_POLICY
 ): boolean {
-  if (recentRiskScores.length < policy.oscillationWindow) {
+  if (recentRiskScores.length >= policy.oscillationWindow) {
     return false;
   }
killedBy: detectOscillation returns false when window has fewer scores than required
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/runtime/gate.ts:26:7
   recentRiskScores: number[] = [],
   policy: GatePolicy = DEFAULT_POLICY
 ): boolean {
-  if (recentRiskScores.length < policy.oscillationWindow) {
+  if (recentRiskScores.length <= policy.oscillationWindow) {
     return false;
   }
killedBy: evaluateGate — decision boundaries STABILIZE on oscillation even with low riskScore
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] BooleanLiteral
lib/runtime/gate.ts:27:12
   policy: GatePolicy = DEFAULT_POLICY
 ): boolean {
   if (recentRiskScores.length < policy.oscillationWindow) {
-    return false;
+    return true;
   }
 
killedBy: evaluateGate — decision boundaries ALLOW when riskScore < 0.4 and no oscillation
statusReason: expected 'STABILIZE' to be 'ALLOW' // Object.is equality

[Killed] UnaryOperator
lib/runtime/gate.ts:30:41
     return false;
   }
 
-  const window = recentRiskScores.slice(-policy.oscillationWindow);
+  const window = recentRiskScores.slice(+policy.oscillationWindow);
   const min = Math.min(...window);
   const max = Math.max(...window);
killedBy: evaluateGate — decision boundaries STABILIZE on oscillation even with low riskScore
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] MethodExpression
lib/runtime/gate.ts:30:18
     return false;
   }
 
-  const window = recentRiskScores.slice(-policy.oscillationWindow);
+  const window = recentRiskScores;
   const min = Math.min(...window);
   const max = Math.max(...window);
killedBy: detectOscillation uses only the last oscillationWindow entries
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
lib/runtime/gate.ts:31:15
   }
 
   const window = recentRiskScores.slice(-policy.oscillationWindow);
-  const min = Math.min(...window);
+  const min = Math.max(...window);
   const max = Math.max(...window);
   return max - min >= policy.oscillationSpread;
killedBy: detectOscillation returns true when max-min >= oscillationSpread
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
lib/runtime/gate.ts:32:15
 
   const window = recentRiskScores.slice(-policy.oscillationWindow);
   const min = Math.min(...window);
-  const max = Math.max(...window);
+  const max = Math.min(...window);
   return max - min >= policy.oscillationSpread;
 }
killedBy: evaluateGate — decision boundaries STABILIZE on oscillation even with low riskScore
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] ArithmeticOperator
lib/runtime/gate.ts:33:10
   const window = recentRiskScores.slice(-policy.oscillationWindow);
   const min = Math.min(...window);
   const max = Math.max(...window);
-  return max - min >= policy.oscillationSpread;
+  return max + min >= policy.oscillationSpread;
 }
 
killedBy: detectOscillation uses only the last oscillationWindow entries
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/runtime/gate.ts:33:10
   const window = recentRiskScores.slice(-policy.oscillationWindow);
   const min = Math.min(...window);
   const max = Math.max(...window);
-  return max - min >= policy.oscillationSpread;
+  return true;
 }
 
killedBy: detectOscillation returns false when spread is below threshold
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/runtime/gate.ts:39:47
 export function evaluateGate(
   input: GateInput,
   policy: GatePolicy = DEFAULT_POLICY
-): { decision: GateDecision; reason: string } {
-  if (input.riskScore >= policy.blockRiskScore) {
-    return { decision: 'BLOCK', reason: 'risk score exceeded block threshold' };
-  }
-
-  if (detectOscillation(input.recentRiskScores, policy)) {
-    return { decision: 'STABILIZE', reason: 'risk oscillation window exceeded spread limit' };
-  }
-
-  if (input.riskScore >= policy.stabilizeRiskScore) {
-    return { decision: 'STABILIZE', reason: 'risk score exceeded stabilize threshold' };
-  }
-
-  return { decision: 'ALLOW', reason: 'risk score below stabilize threshold' };
-}
+): { decision: GateDecision; reason: string } {}
 
killedBy: evaluateGate — decision boundaries BLOCK when riskScore >= 0.8
statusReason: Cannot read properties of undefined (reading 'decision')

[Killed] BlockStatement
lib/runtime/gate.ts:40:49
   input: GateInput,
   policy: GatePolicy = DEFAULT_POLICY
 ): { decision: GateDecision; reason: string } {
-  if (input.riskScore >= policy.blockRiskScore) {
-    return { decision: 'BLOCK', reason: 'risk score exceeded block threshold' };
-  }
+  if (input.riskScore >= policy.blockRiskScore) {}
 
   if (detectOscillation(input.recentRiskScores, policy)) {
killedBy: evaluateGate — default policy returns BLOCK when riskScore >= blockRiskScore (0.8)
statusReason: expected 'STABILIZE' to be 'BLOCK' // Object.is equality

[Killed] EqualityOperator
lib/runtime/gate.ts:40:7
   input: GateInput,
   policy: GatePolicy = DEFAULT_POLICY
 ): { decision: GateDecision; reason: string } {
-  if (input.riskScore >= policy.blockRiskScore) {
+  if (input.riskScore > policy.blockRiskScore) {
     return { decision: 'BLOCK', reason: 'risk score exceeded block threshold' };
   }
killedBy: evaluateGate — default policy returns BLOCK when riskScore >= blockRiskScore (0.8)
statusReason: expected 'STABILIZE' to be 'BLOCK' // Object.is equality

[Killed] ObjectLiteral
lib/runtime/gate.ts:41:12
   policy: GatePolicy = DEFAULT_POLICY
 ): { decision: GateDecision; reason: string } {
   if (input.riskScore >= policy.blockRiskScore) {
-    return { decision: 'BLOCK', reason: 'risk score exceeded block threshold' };
+    return {};
   }
 
killedBy: evaluateGate — decision boundaries BLOCK when riskScore >= 0.8
statusReason: expected undefined to be 'BLOCK' // Object.is equality

[Killed] StringLiteral
lib/runtime/gate.ts:41:24
   policy: GatePolicy = DEFAULT_POLICY
 ): { decision: GateDecision; reason: string } {
   if (input.riskScore >= policy.blockRiskScore) {
-    return { decision: 'BLOCK', reason: 'risk score exceeded block threshold' };
+    return { decision: "", reason: 'risk score exceeded block threshold' };
   }
 
killedBy: evaluateGate — default policy returns BLOCK when riskScore >= blockRiskScore (0.8)
statusReason: expected '' to be 'BLOCK' // Object.is equality

[Killed] BlockStatement
lib/runtime/gate.ts:44:58
     return { decision: 'BLOCK', reason: 'risk score exceeded block threshold' };
   }
 
-  if (detectOscillation(input.recentRiskScores, policy)) {
-    return { decision: 'STABILIZE', reason: 'risk oscillation window exceeded spread limit' };
-  }
+  if (detectOscillation(input.recentRiskScores, policy)) {}
 
   if (input.riskScore >= policy.stabilizeRiskScore) {
killedBy: evaluateGate — default policy returns STABILIZE on oscillation even with low riskScore
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] ConditionalExpression
lib/runtime/gate.ts:44:7
     return { decision: 'BLOCK', reason: 'risk score exceeded block threshold' };
   }
 
-  if (detectOscillation(input.recentRiskScores, policy)) {
+  if (true) {
     return { decision: 'STABILIZE', reason: 'risk oscillation window exceeded spread limit' };
   }
killedBy: evaluateGate — default policy returns ALLOW when risk is low and stable
statusReason: expected 'STABILIZE' to be 'ALLOW' // Object.is equality

[Killed] ConditionalExpression
lib/runtime/gate.ts:48:7
     return { decision: 'STABILIZE', reason: 'risk oscillation window exceeded spread limit' };
   }
 
-  if (input.riskScore >= policy.stabilizeRiskScore) {
+  if (true) {
     return { decision: 'STABILIZE', reason: 'risk score exceeded stabilize threshold' };
   }
killedBy: evaluateGate — default policy returns ALLOW when risk is low and stable
statusReason: expected 'STABILIZE' to be 'ALLOW' // Object.is equality

[Killed] EqualityOperator
lib/runtime/gate.ts:48:7
     return { decision: 'STABILIZE', reason: 'risk oscillation window exceeded spread limit' };
   }
 
-  if (input.riskScore >= policy.stabilizeRiskScore) {
+  if (input.riskScore < policy.stabilizeRiskScore) {
     return { decision: 'STABILIZE', reason: 'risk score exceeded stabilize threshold' };
   }
killedBy: evaluateGate — default policy returns STABILIZE when riskScore >= stabilizeRiskScore (0.4) and no oscillation
statusReason: expected 'ALLOW' to be 'STABILIZE' // Object.is equality

[Killed] StringLiteral
lib/runtime/gate.ts:49:24
   }
 
   if (input.riskScore >= policy.stabilizeRiskScore) {
-    return { decision: 'STABILIZE', reason: 'risk score exceeded stabilize threshold' };
+    return { decision: "", reason: 'risk score exceeded stabilize threshold' };
   }
 
killedBy: evaluateGate — default policy returns STABILIZE when riskScore >= stabilizeRiskScore (0.4) and no oscillation
statusReason: expected '' to be 'STABILIZE' // Object.is equality

[Killed] StringLiteral
lib/runtime/gate.ts:52:22
     return { decision: 'STABILIZE', reason: 'risk score exceeded stabilize threshold' };
   }
 
-  return { decision: 'ALLOW', reason: 'risk score below stabilize threshold' };
+  return { decision: "", reason: 'risk score below stabilize threshold' };
 }
 
killedBy: evaluateGate — default policy returns ALLOW when risk is low and stable
statusReason: expected '' to be 'ALLOW' // Object.is equality

[Killed] StringLiteral
lib/runtime/gate.ts:52:39
     return { decision: 'STABILIZE', reason: 'risk score exceeded stabilize threshold' };
   }
 
-  return { decision: 'ALLOW', reason: 'risk score below stabilize threshold' };
+  return { decision: 'ALLOW', reason: "" };
 }
 
killedBy: evaluateGate — default policy includes reason string in all decision types
statusReason: expected '' to be truthy
